In [3]:
import pandas as pd;
import numpy as np

In [4]:
df = pd.read_csv('ex1.csv')

In [5]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [7]:
pd.read_table('ex1.csv',sep = ',')

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [13]:
!type ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [14]:
pd.read_csv('ex2.csv',header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [18]:
pd.read_csv('ex2.csv',names = ['a','b','c','d','message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [19]:
names = ['a1','b2','c3','d4','e5']

In [20]:
pd.read_csv('ex2.csv',names = names,index_col = 'e5')

       a1  b2  c3  d4
e5
hello   1   2   3   4
world   5   6   7   8
foo     9  10  11  12

In [21]:
!type csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [22]:
parsed = pd.read_csv('csv_mindex.csv',index_col = ['key1','key2'])

In [23]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [25]:
list(open('ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [26]:
result = pd.read_table('ex3.txt',sep = '\s+')

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.

In [27]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [28]:
!type ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [36]:
pd.read_csv('ex5.csv',skiprows = [0,1,2])

Empty DataFrame
Columns: [three, 9, 10, 11, 12, foo]
Index: []

In [37]:
result = pd.read_csv('ex5.csv',na_values = ['NULL'])

result

In [38]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [39]:
sentinels = {'message':['foo','NA'],'something':['two']}

In [40]:
pd.read_csv('ex5.csv',na_values = sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [4]:
pd.options.display.max_rows = 10

In [6]:
result = pd.read_csv('ex6.csv')

In [7]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [8]:
pd.read_csv('ex6.csv',nrows = 5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [9]:
chunker = pd.read_csv('ex6.csv',chunksize = 1000)

In [10]:
chunker

In [14]:
chunker = pd.read_csv('ex6.csv',chunksize = 1000)
tot = pd.Series([])
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(),fill_value = 0)
    tot = tot.sort_values(ascending = False)

In [15]:
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

In [17]:
data = pd.read_csv('ex5.csv')

In [18]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [19]:
data.to_csv('out.csv')

In [20]:
!type out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [21]:
import sys

In [22]:
data.to_csv(sys.stdout,sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [23]:
data.to_csv(sys.stdout,na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [24]:
data.to_csv(sys.stdout,index = False,header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [25]:
data.to_csv(sys.stdout,index = False,columns=['a','b','c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [31]:
datas = pd.date_range('1/1/2000',periods = 32)

In [32]:
ts = pd.Series(np.arange(32),index = datas)

In [34]:
ts.to_csv('tseries.csv')

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: The signature of `Series.to_csv` was aligned to that of `DataFrame.to_csv`, and argument 'header' will change its default value from False to True: please pass an explicit value to suppress this warning.
  """Entry point for launching an IPython kernel.

In [35]:
!type tseries.csv

2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6
2000-01-08,7
2000-01-09,8
2000-01-10,9
2000-01-11,10
2000-01-12,11
2000-01-13,12
2000-01-14,13
2000-01-15,14
2000-01-16,15
2000-01-17,16
2000-01-18,17
2000-01-19,18
2000-01-20,19
2000-01-21,20
2000-01-22,21
2000-01-23,22
2000-01-24,23
2000-01-25,24
2000-01-26,25
2000-01-27,26
2000-01-28,27
2000-01-29,28
2000-01-30,29
2000-01-31,30
2000-02-01,31

In [36]:
!type ex7.csv

"a","b","c"
"1","2","3"
"1","2","3","4"

In [37]:
import csv

In [38]:
f = open('ex7.csv')

In [40]:
reader = csv.reader(f)

In [42]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3', '4']

In [44]:
with open('ex7.csv') as f:
    lines = list(csv.reader(f))

In [45]:
header,values = lines[0],line[1:]

In [46]:
data_dict = {h:v for h,v in zip(header,zip(*values))}

In [47]:
data_dict

{'a': ('2', '3', '4')}

In [51]:
class  my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ';'
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL

In [63]:
import json

In [66]:
obj = """
{"name":"Wes",
"place_lived":["United States","Spain","Germany"],
"pet":null,
"silings":[{"name":"Scott","age":18,"pet":["Zeus","Zuko"]},
            {"name":Katie},"age":30,"pet":["Sixes","Stache","Cisco"]}
]}
"""

In [73]:
!type example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [74]:
data = pd.read_json('example.json')

In [75]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [77]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [78]:
print(data.to_json(orient= 'records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

In [79]:
table = pd.read_html('fdic_failed_bank_list.html')

In [80]:
table

[                             Bank Name             City  ST   CERT  \
 0                          Allied Bank         Mulberry  AR     91
 1         The Woodbury Banking Company         Woodbury  GA  11297
 2               First CornerStone Bank  King of Prussia  PA  35312
 3                   Trust Company Bank          Memphis  TN   9956
 4           North Milwaukee State Bank        Milwaukee  WI  20364
 ..                                 ...              ...  ..    ...
 542                 Superior Bank, FSB         Hinsdale  IL  32646
 543                Malta National Bank            Malta  OH   6629
 544    First Alliance Bank & Trust Co.       Manchester  NH  34264
 545  National State Bank of Metropolis       Metropolis  IL   3815
 546                   Bank of Honolulu         Honolulu  HI  21029

                    Acquiring Institution        Closing Date  \
 0                           Today's Bank  September 23, 2016
 1                            United Bank     August 19, 2016
 2    First-Citizens Bank & Trust Company         May 6, 2016
 3             The Bank of Fayette County      April 29, 2016
 4    First-Citizens Bank & Trust Company      March 11, 2016
 ..                                   ...                 ...
 542                Superior Federal, FSB       July 27, 2001
 543                    North Valley Bank         May 3, 2001
 544  Southern New Hampshire Bank & Trust    February 2, 2001
 545              Banterra Bank of Marion   December 14, 2000
 546                   Bank of the Orient    October 13, 2000

           Updated Date
 0    November 17, 2016
 1    November 17, 2016
 2    September 6, 2016
 3    September 6, 2016
 4        June 16, 2016
 ..                 ...
 542    August 19, 2014
 543  November 18, 2002
 544  February 18, 2003
 545     March 17, 2005
 546     March 17, 2005

 [547 rows x 7 columns]]

In [81]:
len(table)

1

In [82]:
failures = table[0]

In [83]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [84]:
close_timestamps = pd.to_datetime(failures['Closing Date'])

In [85]:
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, Length: 15, dtype: int64

In [87]:
from lxml import objectify

In [88]:
path = 'Performance_MNR.xml'

In [89]:
parsed = objectify.parse(open(path))

In [90]:
root = parsed.getroot()

In [91]:
data = []

In [93]:
skip_fields = ['PARENT_SEQ','INDICATOR_SEQ','DESIRED_CHANGE','DECIMAL_PLACES']
for elt in root .INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
            el_data[child.tag] = child.pyval
            data.append(el_data)

In [94]:
perf = pd.DataFrame(data)

In [95]:
perf

Empty DataFrame
Columns: []
Index: []

In [100]:
perf.head()

Empty DataFrame
Columns: []
Index: []

In [103]:
from io import StringIO
tag = '<a  href="http://www.google.com">Google</a>'
root = objectify.parse(StringIO(tag)).getroot()

In [104]:
root

In [105]:
root.get('href')

'http://www.google.com'

In [106]:
root.text

'Google'

In [107]:
frame = pd.read_csv('ex1.csv')

In [108]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [109]:
frame.to_pickle('frame_pickle')

In [110]:
pd.read_pickle('frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [111]:
frame = pd.DataFrame({'a':np.random.randn(100)})

In [112]:
store = pd.HDFStore('mydata.h5')

In [113]:
store['obj1'] = frame

In [114]:
store['obj1_col'] = frame['a']

In [115]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [116]:
store['obj1']

           a
0  -1.729314
1   0.670954
2  -0.429855
3   1.539760
4  -1.071730
..       ...
95  1.092246
96  0.579102
97 -0.715200
98  1.641471
99 -0.128259

[100 rows x 1 columns]

In [117]:
store.put('obj2',frame,format = 'table')

In [118]:
store.select('obj2',where = ['index >=10 and index<=15'])

           a
10  1.241147
11  0.064449
12 -0.757293
13  1.362213
14 -1.578417
15 -2.083706

In [119]:
store.close()

In [120]:
frame.to_hdf('mydata.h5','obj3',format = 'table')

In [121]:
pd.read_hdf('mydata.h5','obj3',where = ['index < 5'])

          a
0 -1.729314
1  0.670954
2 -0.429855
3  1.539760
4 -1.071730

In [122]:
xlsx = pd.ExcelFile('ex1.xlsx')

In [124]:
pd.read_excel(xlsx,'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [125]:
frame = pd.read_excel('ex1.xlsx','Sheet1')

In [126]:
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [127]:
writer = pd.ExcelWriter('ex2.xlsx')

In [128]:
frame.to_excel(writer,'Sheet1')

In [129]:
writer.save()

In [130]:
frame.to_excel('ex2.xlsx')

In [131]:
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [132]:
writer